REST
HTTP URI를 통해 자원을 명시하고 HTTP Method(POST, PUT, GET, DELETE)를 통해 해당 자원에 대한 명령을 적용하는 기술

SET SERVEROUTPUT ON
PL/SQL의 처리결과를 화면에 출력하기 위한 SQL 명령어

가비지컬렉션
메모리 관리 기법의 하나로, 프로그램이 동적으로 할당했던 메모리 영역 중에서 필요 없게된 영역을 해제하는 기능

백본망
컴퓨터 네트워크의 일부로서, 각기 다른 LAN이나 부분망 간에 정보를 교환하기 위한 경로를 제공하는 망

CSRF
사용자가 자신의 의지와는 무관하게 공격자가 의도한 행위를 특정 웹사이트에 요청하게 하는 공격기법

SOAP
HTTP, HTTPS, SMTP 등을 사용하여 XML 기반의 메시지를 네트워크 상태에서 교환하는 프로토콜

WSDL
웹 서비스명, 제공위치, 프로토콜 정보 등 웹 서비스에 대한 상세 정보를 XML 형식으로 기술한 파일

UDDI
WSDL에 등록하고 검색하기 위한 저장소

스턱스넷
지맨스의 SCADA 시스템만을 감염시켜 장비를 제어하고 감시하는 특수한 코드를 내부에 담고 있고, 장비를 프로그램하는데 사용되는 PLC를 감염시켜 장비의 동작을 변경하는 2010년 6월에 발견된 웜 바이러스

RIP
최단 경로 탐색을 위해서 벨만-포드 알고리즘을 사용하는 거리 벡터 라우팅 프로토콜

OSPF
링크상태 알고리즘을 사용하며 토폴로지에 대한 정보가 전체 라우터에 동일하게 유지되는 프로토콜

오류-부재의 궤변
사용자의 요구사항을 충족시켜주지 못한다면, 오류가 없다고 해도 품질이 높다고 볼 수 없는 소프트웨어 테스트의 원리

파레토 법칙
20%의 모듈에서 80%의 결함이 발견되는 테스트 원리

회귀테스트
오류를 제거하거나 수정한 시스템에서 오류 제거와 수정에 의해 새로이 유입된 오류가 없는지 확인하는 일종의 반복 테스트

면책조항
릴리즈 노트 작성 항목 중 회사 및 표준 제품과 관련된 메시지, 프리웨어 및 불법 복제 방지, 중복 등 참조에 대한 고려사항

워크스루
검토 자료를 회의전에 배포해서 사전에 검토를 진행한 후 짧은 시간 동안 회의를 통해 코드의 오류를 검출하고 문서화하는 기법

인스펙션
소프트웨어 요구, 설계, 원시 코드 등의 저작자 외의 다른 전문가 또는 팀이 검사하여 오류를 찾아내는 공식적 검토 기법

상호운용성
다른 목적을 지닌 2개 이상 시스템들이 상호 간 정보 및 서비스를 교환하면서 효과적으로 운용될 수 있는 시스템의 능력

스텁
하향식 통합에 있어서 모듈 간의 통합 시험을 위해 일시적으로 필요한 조건만을 가지고 임시로 제공되는 시험용 모듈

드라이버
상위의 모듈에서 데이터의 입력과 출력을 확인하기 위한 더미 모듈로 상향식 통합 테스트에 사용되는 것

패키저
저작권 관리에서 콘텐츠를 메타 데이터와 함께 배포 가능한 단위로 묶는 기능을 수행하는 것

클리어링 하우스
저작권 관리에서 키 관리 및 라이선스 발급 관리를 수행하는 것

보안 컨테이너
저작권 관리에서 원본을 안전하게 유통하기 위한 전자적 보안 장치

STAF
서비스 호출, 컴포넌트 재사용 등 다양한 환경을 지원하는 테스트 프레임워크

메시지버스
EAI 구축 유형 중, 애플리케이션 사이에 미들웨어를 두어 연계하는 미들웨어 통합 방식을 사용하여 뛰어난 확장성과 대용량 데이터를 처리 가능한 유형

Hub&Spoke
EAI 구축 유형 중, 단일한 접점의 허브 시스템을 통하여 데이터를 전송하는 중앙 집중식 방식으로 허브 장애시 전체 장애 발생

MPEG-21
멀티미디어 관련 요소 기술들이 통일된 형태로 상호 운용성을 보장하는 멀티미디어 표준 규격

SSO
한 번의 시스템 인증을 통하여 여러 정보시스템에 재인증 절차 없이 접근할 수 있는 통합 로그인 기술

DOI
디지털 저작물에 특정한 번호를 부여하는 일종의 바코드 시스템으로서 디지털 저작물의 저작권 보호 및 정확한 위치 추적이 가능한 시스템

라우터
데이터 패킷을 발신지에서 목적지까지 전달하기 위해 최적의 경로를 지정하고, 이 경로를 따라 데이터 패킷을 다음 장치로 전달 하는 네트워크 장비

라이브러리
효율적인 프로그램 개발을 위해 필요한 프로그램을 모아놓은 집합체로서, 프로그래밍 언어에 따라 일반적으로 도움말, 설치 파일, 샘플 코드 등을 제공하는 프로그램

시큐어코딩
설계 및 구현 단계에서 해킹 등의 공격을 유발할 가능성이 있는 잠재적인 보안 취약점을 사전에 제거하고, 외부 공격으로부터 안 전한 소프트웨어를 개발하는 기법, 개발하는 소프트웨어가 복잡해짐으로 인해 보안상 취약점이 발생할 수 있는 부분을 보완하여 프로그래밍하는 것으로 안전한 소 프트웨어를 개발하기 위해 지켜야 할 코딩 규칙과 소스 코드 취약 목록이 포함된 코딩
